Autodesk.Revit.DB.IndependentTag.GetTagBoxMiddlePoints(Autodesk.Revit.DB.View)
Calculates the midpoints of the four bounding box edges around the tag head.
These are the points to which the leader would attach to the tag head.
DBView:
If the view is available, it should always be passed. If not, the tag's owner's view will be utilized.
Returns:
The points order is East, West, North, and South.

Autodesk.Revit.DB.IndependentTag.SetIsLeaderVisible(Autodesk.Revit.DB.Reference,System.Boolean)
Set tag's leader that points to specified reference to be visible or not. This option can be set only if the LeadersPresentationMode is ShowSpecificLeaders.
referenceTagged:
The reference which is tagged.
visible:
True for showing the leader, false to hide it.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
For this tag leaders are not allowed.
-or-
The LeadersPresentationMode should be set to ShowSpecificLeaders.
Since:
2023

Autodesk.Revit.DB.IndependentTag.RemoveReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Removes the provided list of references from the tag's list of references.
Remarks:
If the tag is owned by MRA element, an exception will be thrown.
referencesToRemove:
References to be removed from tag.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The operation failed. Please verify that the references are all tagged before removing them.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
Modifying tag references for MRA owned tag from API is not allowed.
Since:
2022

Autodesk.Revit.DB.IndependentTag.AddReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Adds the provided list of references to the tag's list of references.
Remarks:
The references must pass the following requirements to be added:
Must not be owned by MRA element.Must not be already tagged.Must be of the same category when TagMode is TM_ADDBY_CATEGORY.Must be taggable by this tag type.For multiple references, the tag type must have this functionality supported in the UI.
If any of the above rules is not fulfilled, the execution will be stopped and an exception will be thrown
referencesToTag:
References to be tagged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The operation failed. Please verify that the references are all taggable and that they are not already tagged.
-or-
This type of tag does not support multiple references.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
Modifying tag references for MRA owned tag from API is not allowed.
Since:
2022

Autodesk.Revit.DB.IndependentTag.SetLeaderEnd(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Set the end position of the tag's leader that points to specified reference.
Remarks:
Tags with attached leaders or no leaders do not support leader ends.
Autodesk.Revit.DB.IndependentTag.LeaderEndCondition for the tag's leader condition.
referenceTagged:
The reference which is tagged.
pointEnd:
Point representing the end position of tag's leader
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no leader end because the tag does not use a free end leader or the leader is not visible.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
For this tag leaders are not allowed.
Since:
2022

Autodesk.Revit.DB.IndependentTag.SetLeaderElbow(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Set the position of the elbow of the tag's leader that points to specified reference.
If this tag is a multileader tag and the elbows are merged, the input position will be set to all leaders.
Remarks:
Straight leaders do not have elbow points.
referenceTagged:
The reference which is tagged.
elbowPosition:
The position of the elbow.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
-or-
The leader for the tagged reference isn't visible.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
For this tag leaders are not allowed.
Since:
2022

Autodesk.Revit.DB.IndependentTag.HasTagText
Checks if the IndependentTag has a valid tag text.
Returns:
True if the IndependentTag object has a valid tag text.
Since:
2025.3

Autodesk.Revit.DB.IndependentTag.LeaderEndCondition
The leader end condition of the tag, such as if the end of the leader is attached to the host or free floating.
Remarks:
Autodesk.Revit.DB.LeaderEndCondition enumerates the supported leader end conditions.
Material tags and material keynotes can only use the free end condition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: LeaderEndCondition cannot be assigned.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
When setting this property: For this tag leaders are not allowed.

Autodesk.Revit.DB.IndependentTag.TagText
The text associated with the tag. If there are several strings assiciated with the tag, the strings will be returned concatenated.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
The IndependentTag object does not have a valid tag text.
-or-
The tagging element is in the link.

Autodesk.Revit.DB.IndependentTag.HeadAlignmentOption
The tag-head alignment option relative to the Bending Detail.

Autodesk.Revit.DB.IndependentTag
Represents tag annotations in Revit.
getBBoxCorers in MultipleAlignmentHelper needs access to some protected members.
Remarks:
IndependentTag represents single-category tags, multi-category tags, material tags, and zone tags.
IndependentTag is also the base class for other annotations like keynote tags and span symbols.
Room, area and space tags are not derived from IndependentTag.  Autodesk::Revit::DB::SpatialElementTag for more information.